src/cf/Documents/bon_ВводВОборотНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_ВводВОборотНоминальныхОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_СостоянияНоминальныхОбъектов</xr:Item>
				<xr:Item>InformationRegister.bon_СведенияОНоминальныхОбъектах</xr:Item>
				<xr:Item>AccumulationRegister.bon_ПартииБонусовНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминальныхОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоминальныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Держатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/bon_ВводВОборотНоминальныхОбъектов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//текВидНомера = ПолучитьТекущийВидНомера();
	
	//Объект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновноеПодразделениеОрганизации");
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ ВЗАИМОДЕЙСТВИЯ С ТОРГОВЫМ ОБОРУДОВАНИЕМ (ОБЩИЕ ФУНКЦИИ API)

&НаСервере
Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода
	 Или Вид = Перечисления.ВидыТорговогоОборудования.СчитывательМагнитныхКарт Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПоддерживаетсяВидТО()

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли;

	//ПолучитьСерверТО().ОбработатьВнешнееСобытие(Событие, Данные, ЭтаФорма);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
//// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
 
&НаСервере
Функция ОбработкаВводаНомера(НовыйНомер, НоминальныйОбъект = Неопределено)
	
	РезультатОбработки = "";
	ОбъектБудетСоздан = Ложь;
	мНоминальныйОбъект = Неопределено;
	мНоминал = 0;
	
	Если ЗначениеЗаполнено(НоминальныйОбъект) Тогда
		НовыйНомер = НоминальныйОбъект.Код;	
	КонецЕсли; 
	
	// проверим на совпадение с уже введенными номерами
	Для каждого стрТЧ Из Объект.НоминальныеОбъекты Цикл
		
		Если стрТЧ.Номер = НовыйНомер Тогда
			
			РезультатОбработки = "Номер <" + НовыйНомер + "> уже введен в документ!";
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если РезультатОбработки <> "" Тогда
		Возврат РезультатОбработки;	
	КонецЕсли;
	
	СведенияОбОбъекте = bon_БонуснаяПрограммаСервер.ПолучитьСведенияОНоминальномОбъекте(НовыйНомер, ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Дата));
	мНоминальныйОбъект = СведенияОбОбъекте.НоминальныйОбъект;
	мНоминал = 0;//СведенияОбОбъекте.Номинал;
	
	ОбъектБудетСоздан = НЕ ЗначениеЗаполнено(мНоминальныйОбъект);

	// в случае существующего проверим совпадения вида
	Если НЕ ОбъектБудетСоздан Тогда
		Если Объект.ВидНоминальныхОбъектов <> мНоминальныйОбъект.Владелец Тогда
			РезультатОбработки = "Номинальный объект с номером <" + НовыйНомер + "> не является видом " + Объект.ВидНоминальныхОбъектов + "!";	
		КонецЕсли; 	
	КонецЕсли; 	
	
	Если РезультатОбработки <> "" Тогда
		Возврат РезультатОбработки;	
	КонецЕсли;
	
	нстрТЧ = Объект.НоминальныеОбъекты.Добавить();
	нстрТЧ.Номер = НовыйНомер;
	нстрТЧ.НоминальныйОбъект = мНоминальныйОбъект;
	нстрТЧ.Номинал			 = мНоминал;
	
	Если ОбъектБудетСоздан Тогда
		РезультатОбработки = "Номинальный объект с номером <" + НовыйНомер + "> будет создан при проведении документа!";	
	КонецЕсли; 
	
	Возврат РезультатОбработки;
	
КонецФункции
 
&НаСервере
Процедура УстановитьДоступностьПериодаДействия()
	
	ОграничениеПоПериодуДействия = Объект.ВидНоминальныхОбъектов.ОграничениеПоПериодуДействия;
	
	Элементы.ПериодДействияНачало.Доступность 	= ОграничениеПоПериодуДействия; 
	Элементы.ПериодДействияКонец.Доступность 	= ОграничениеПоПериодуДействия;
	
КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)        // 050318 Андрей Загрузка из файла номеров
	Перем Стр;
        Стр = "";
        //Открываем диалог выбора файла для чтения
        ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
        ВыборФайла.МножественныйВыбор = Ложь;
        ВыборФайла.Заголовок = НСтр("ru = ‘Выбор файла'");
        ВыборФайла.Фильтр = НСтр("ru = ‘Все файлы (*.*)|*.*'");
		Если ВыборФайла.Выбрать()  Тогда
              ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
        Иначе
              Возврат;
		  КонецЕсли; 
		  
        Текст = Новый ЧтениеТекста;
        Текст.Открыть(ПолноеИмяФайла); 
 
        Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки
                 Стр = Текст.ПрочитатьСтроку();
				 Если Стр <> Неопределено Тогда               //Последняя строка пустая не должна выходить
				 Ст = Объект.НоминальныеОбъекты.Добавить();
				 Ст.Номер = СокрЛП(Стр);
                Сообщить(Стр);
				КонецЕсли;
         КонецЦикла;
        Текст.Закрыть();
	
КонецПроцедуры
